Revit 2027 API
DoubleClickTarget Enumeration
 Elements that support double-click in Revit. Note that this is meant to cover cases where the element itself is a double-click target. Individual controls that are targets are handled separately.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DoubleClickTarget
Public Enumeration DoubleClickTarget
public enum class DoubleClickTarget
type DoubleClickTarget
Members
Member name | Value | Description
Assembly | 3 |  Assemblies
ComponentStairs | 5 |  Component-based stairs
Family | 0 |  Family instances
Group | 4 |  Groups
OutsideViewOnSheet | 6 |  Outside active view on sheet
ProjectBrowser | 7 |  Project Browser slow double-click
ScheduleOnSheet | 8 |  Schedules on sheets
SketchedElement | 1 |  Sketch-based elements
ViewOnSheet | 2 |  Views on sheets
See Also
Reference
Autodesk.Revit.UI Namespace